app/views/partials/_post.html.erb

      <% if post.comments %>
        <% post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 15]]