app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 15]]
---
        <% if post.comments %>
          <% post.comments.each do |comment| %>