app/controllers/comments_controller.rb

  def create
    # This was my original attempt. I had the right idea, however,
    # @comment = current_user.posts.build(post_params)
    # This assigns the comments on the @post object as a object in memory with text to @comment
    # This is different from the one I put in. This has to do with the POST first and the comments.
    # The relationship here is of a post that has a comment, not a current uses that is creating a post. However, we need to change whatever user the post is associated with to the user currently logged in.
    @comment = @post.comments.build(comment_params)

    #  Interesting - this is where the current_user id comes from. I thought I would put it in there before the posts up the top, but that wouldn't have worked or wouldn't have been good practice?? or something else. In anycase this is clear about what's happening
    @comment.user_id = current_user.id

    # I got this right. This will save the comment object to the database, and return a true if it does save which will result in a message telling the user  the comment has been added and navigate to the previous page.
    if @comment.save
---
INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 5], ["post_id", 15], ["content", "qjioeu"], ["created_at", 2017-03-23 02:50:27 UTC], ["updated_at", 2017-03-23 02:50:27 UTC]]

  def destroy
    @comment = @post.comments.find(params[:id])

    if @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 15], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]

    def set_post
      # This will go into the Post table find the id of the post, to make sure the post we are commenting on will be the post that we are currently viewing. The post_id will be the automatically generated number and will be in the URL
      @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]