app/controllers/posts_controller.rb

  def index
    @post_all = Post.all
---
SELECT "posts".* FROM "posts"

  def create

    @post = current_user.posts.build(post_params)

    # OLD @post = Post.create(post_params)
    # this is asking if the post has save, it returns true if it has.
    if @post.save
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    # like the previous, this finds id of the current post and slots it into @post
    # @post = Post.find(params[:id])
    # This is an inbuilt function that updates an attribute in an object row of the table
    # post_params is the parameters that are to be potentially updated, in this case the
    # immage and caption of a post
    if @post.update(post_params)
---
UPDATE "posts" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?

  def destroy
    # @post = Post.find(params[:id])
    if @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]